apache/nuttx/arch/mips/src/pic32mz/pic32mz-timer.c
/****************************************************************************
 * arch/mips/src/pic32mz/chip/pic32mz-timer.c
 *
 *   Copyright (C) 2019 Abdelatif Guettouche. All rights reserved.
 *   Author: Abdelatif Guettouche <abdelatif.guettouche@gmail.com>
 *
 * This file is a part of NuttX:
 *
 *   Copyright (C) 2019 Gregory Nutt. All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <semaphore.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>

#include <arch/board/board.h>

#include "up_internal.h"
#include "up_arch.h"

#include "chip/pic32mz-timer.h"
#include "pic32mz-timer.h"
#include "pic32mz-gpio.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* This module is for the type B timers only.
 * Type A (timer1) is used by the system.
 */

#if defined(CONFIG_PIC32MZ_T2) || defined(CONFIG_PIC32MZ_T3) || \
    defined(CONFIG_PIC32MZ_T4) || defined(CONFIG_PIC32MZ_T5) || \
    defined(CONFIG_PIC32MZ_T6) || defined(CONFIG_PIC32MZ_T7) || \
    defined(CONFIG_PIC32MZ_T8) || defined(CONFIG_PIC32MZ_T9)

/* Undef odd timers if mode32 is enabled in even timers.
 * If mode32 is enabled the consecutive odd timers will be automatically
 * enabled through menuconfig.
 * This is an indication for the user that the odd timer is in use
 * and to avoid a seperate, incorrect, utilization.
 * Undef it here so its (useless in this case) structures won't be created
 * later.
 */

#ifdef CONFIG_PIC32MZ_T2_MODE32
#  undef CONFIG_PIC32MZ_T3
#endif

#ifdef CONFIG_PIC32MZ_T4_MODE32
#  undef CONFIG_PIC32MZ_T5
#endif

#ifdef CONFIG_PIC32MZ_T6_MODE32
#  undef CONFIG_PIC32MZ_T7
#endif

#ifdef CONFIG_PIC32MZ_T8_MODE32
#  undef CONFIG_PIC32MZ_T9
#endif

/* Prescale values */

#define  PIC32MZ_TIMER_PRESCALE_1_1    0
#define  PIC32MZ_TIMER_PRESCALE_1_2    1
#define  PIC32MZ_TIMER_PRESCALE_1_4    2
#define  PIC32MZ_TIMER_PRESCALE_1_8    3
#define  PIC32MZ_TIMER_PRESCALE_1_16   4
#define  PIC32MZ_TIMER_PRESCALE_1_32   5
#define  PIC32MZ_TIMER_PRESCALE_1_64   6
#define  PIC32MZ_TIMER_PRESCALE_1_256  7

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Timer's hardware configuration */

struct pic32mz_timer_config_s
{
  uint32_t  base;        /* Timer's base address       */
  uint32_t  irq;         /* Timer's event irq          */
  bool      stopinidle;  /* True: stop in idle         */
  bool      gated;       /* True: enable gated mode    */
  uint8_t   prescale;    /* Timer's prescale value     */
  bool      mode32;      /* True: enable mode 32bit    */
  bool      extclock;    /* True: use external clock   */
  uint32_t  tckreg;      /* Timer's clock PPS register */
  uint8_t   tckpps;      /* Timer's PPS value          */
  uint32_t  tckpin;      /* GPIO config for the input  */
};

/* Timer's Device Structure */

struct pic32mz_timer_priv_s
{
  const struct pic32mz_timer_ops_s *ops;
  struct pic32mz_timer_config_s *config;
  bool inuse;
};

/****************************************************************************
 * Private Function prototypes
 ****************************************************************************/

/* Helpers */

static inline uint32_t pic32mz_getreg(FAR struct pic32mz_timer_dev_s *dev,
                                      uint16_t offset);
static inline void pic32mz_putreg(FAR struct pic32mz_timer_dev_s *dev,
                                  uint16_t offset, uint32_t value);
static inline bool pic32mz_timer_mode32(FAR struct pic32mz_timer_dev_s *dev);
static inline uint32_t pic32mz_timer_oddoffset(uint32_t evenoffset);
static inline uint32_t pic32mz_timer_nextirq(FAR struct pic32mz_timer_dev_s *dev);

static void pic32mz_timer_stopinidle(FAR struct pic32mz_timer_dev_s *dev,
                                    bool stop);
static void pic32mz_timer_enablegate(FAR struct pic32mz_timer_dev_s *dev,
                                     bool enable);
static void pic32mz_timer_setprescale(FAR struct pic32mz_timer_dev_s *dev,
                                      uint8_t prescale);
static void pic32mz_timer_setmode32(FAR struct pic32mz_timer_dev_s *dev,
                                    bool enable);
static void pic32mz_timer_extclocksource(FAR struct pic32mz_timer_dev_s *dev,
                                         bool enable);
static void pic32mz_timer_inithardware(FAR struct pic32mz_timer_dev_s *dev);

/* Timer's methods */

