apache/nuttx/arch/mips/src/pic32mz/pic32mz-timer.c
static void pic32mz_timer_start(FAR struct pic32mz_timer_dev_s *dev);
static void pic32mz_timer_stop(FAR struct pic32mz_timer_dev_s *dev);
static void pic32mz_timer_setperiod(FAR struct pic32mz_timer_dev_s *dev,
                                    uint32_t period);
static uint32_t pic32mz_timer_getcounter(FAR struct pic32mz_timer_dev_s *dev);
static void pic32mz_timer_setcounter(FAR struct pic32mz_timer_dev_s *dev,
                                     uint32_t count);
static uint32_t pic32mz_timer_getfreq(FAR struct pic32mz_timer_dev_s *dev);
static bool pic32mz_timer_setfreq(FAR struct pic32mz_timer_dev_s *dev,
                                  uint32_t freq);
static uint8_t pic32mz_timer_getwidth(FAR struct pic32mz_timer_dev_s *dev);

static int  pic32mz_timer_setisr(FAR struct pic32mz_timer_dev_s *dev,
                                 xcpt_t handler, void *arg);
static void pic32mz_timer_ackint(FAR struct pic32mz_timer_dev_s *dev);
static bool  pic32mz_timer_checkint(FAR struct pic32mz_timer_dev_s *dev);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct pic32mz_timer_ops_s pic32mz_timer_ops =
{
  .start       = pic32mz_timer_start,
  .stop        = pic32mz_timer_stop,
  .setperiod   = pic32mz_timer_setperiod,
  .getcounter  = pic32mz_timer_getcounter,
  .setcounter  = pic32mz_timer_setcounter,
  .getfreq     = pic32mz_timer_getfreq,
  .setfreq     = pic32mz_timer_setfreq,
  .getwidth    = pic32mz_timer_getwidth,

  .setisr      = pic32mz_timer_setisr,
  .ackint      = pic32mz_timer_ackint,
  .checkint    = pic32mz_timer_checkint,
};

#ifdef CONFIG_PIC32MZ_T2
static struct pic32mz_timer_config_s pic32mz_timer_t2_config =
{
  .base       = PIC32MZ_TIMER2_K1BASE,
  .irq        = PIC32MZ_IRQ_T2,
#ifdef CONFIG_PIC32MZ_T2_STOPINIDLE
  .stopinidle = true,
#else
  .stopinidle = false,
#endif
#ifdef CONFIG_PIC32MZ_T2_GATED
  .gated     = true,
  .tckreg    = PIC32MZ_T2CKR,
  .tckpps    = BOARD_T2CK_PPS,
  .tckpin    = GPIO_T2CK,
#else
  .gated     = false,
#endif
  .prescale  = CONFIG_PIC32MZ_T2_PRESCALE,
#ifdef CONFIG_PIC32MZ_T2_MODE32
  .mode32    = true,
#else
  .mode32    = false,
#endif
#ifdef CONFIG_PIC32MZ_T2_EXTERNALCLOCK
  .extclock  = true,
  .tckreg    = PIC32MZ_T2CKR,
  .tckpps    = BOARD_T2CK_PPS,
  .tckpin    = GPIO_T2CK,
#else
  .extclock  = false,
#endif
};

static struct pic32mz_timer_priv_s pic32mz_t2_priv =
{
  .ops        = &pic32mz_timer_ops,
  .config     = &pic32mz_timer_t2_config,
  .inuse      = false,
};
#endif

#ifdef CONFIG_PIC32MZ_T3
static struct pic32mz_timer_config_s pic32mz_timer_t3_config =
{
  .base       = PIC32MZ_TIMER3_K1BASE,
  .irq        = PIC32MZ_IRQ_T3,
#ifdef CONFIG_PIC32MZ_T3_STOPINIDLE
  .stopinidle = true,
#else
  .stopinidle = false,
#endif
#ifdef CONFIG_PIC32MZ_T3_GATED
  .gated     = true,
  .tckreg    = PIC32MZ_T3CKR,
  .tckpps    = BOARD_T3CK_PPS,
  .tckpin    = GPIO_T3CK,
#else
  .gated     = false,
#endif
  .prescale  = CONFIG_PIC32MZ_T3_PRESCALE,
  .mode32    = false,
#ifdef CONFIG_PIC32MZ_T3_EXTERNALCLOCK
  .extclock  = true,
  .tckreg    = PIC32MZ_T3CKR,
  .tckpps    = BOARD_T3CK_PPS,
  .tckpin    = GPIO_T3CK,
#else
  .extclock  = false,
#endif
};

static struct pic32mz_timer_priv_s pic32mz_t3_priv =
{
  .ops        = &pic32mz_timer_ops,
  .config     = &pic32mz_timer_t3_config,
  .inuse      = false,
};
#endif

#ifdef CONFIG_PIC32MZ_T4
static struct pic32mz_timer_config_s pic32mz_timer_t4_config =
{
  .base       = PIC32MZ_TIMER4_K1BASE,
  .irq        = PIC32MZ_IRQ_T4,
#ifdef CONFIG_PIC32MZ_T4_STOPINIDLE
  .stopinidle = true,
#else
  .stopinidle = false,
#endif
#ifdef CONFIG_PIC32MZ_T4_GATED
  .gated     = true,
  .tckreg    = PIC32MZ_T4CKR,
  .tckpps    = BOARD_T4CK_PPS,
  .tckpin    = GPIO_T4CK,
#else
  .gated     = false,
#endif
  .prescale  = CONFIG_PIC32MZ_T4_PRESCALE,
#ifdef CONFIG_PIC32MZ_T4_MODE32
  .mode32    = true,
#else
  .mode32    = false,
#endif
#ifdef CONFIG_PIC32MZ_T4_EXTERNALCLOCK
  .extclock  = true,
  .tckreg    = PIC32MZ_T4CKR,
  .tckpps    = BOARD_T4CK_PPS,
  .tckpin    = GPIO_T4CK,
#else
  .extclock  = false,
#endif
};

static struct pic32mz_timer_priv_s pic32mz_t4_priv =
{
  .ops        = &pic32mz_timer_ops,
  .config     = &pic32mz_timer_t4_config,
  .inuse      = false,
};
#endif

#ifdef CONFIG_PIC32MZ_T5
static struct pic32mz_timer_config_s pic32mz_timer_t5_config =
{
  .base       = PIC32MZ_TIMER5_K1BASE,
  .irq        = PIC32MZ_IRQ_T5,
#ifdef CONFIG_PIC32MZ_T5_STOPINIDLE
  .stopinidle = true,
#else
  .stopinidle = false,
#endif
#ifdef CONFIG_PIC32MZ_T5_GATED
  .gated     = true,
  .tckreg    = PIC32MZ_T5CKR,
  .tckpps    = BOARD_T5CK_PPS,
  .tckpin    = GPIO_T5CK,
#else
  .gated     = false,
#endif
  .prescale  = CONFIG_PIC32MZ_T5_PRESCALE,
  .mode32    = false,
#ifdef CONFIG_PIC32MZ_T5_EXTERNALCLOCK
  .extclock  = true,
  .tckreg    = PIC32MZ_T5CKR,
  .tckpps    = BOARD_T5CK_PPS,
  .tckpin    = GPIO_T5CK,
#else
  .extclock  = false,
#endif
};

static struct pic32mz_timer_priv_s pic32mz_t5_priv =
{
  .ops        = &pic32mz_timer_ops,
  .config     = &pic32mz_timer_t5_config,
  .inuse      = false,
};
#endif

#ifdef CONFIG_PIC32MZ_T6
static struct pic32mz_timer_config_s pic32mz_timer_t6_config =
{
  .base       = PIC32MZ_TIMER6_K1BASE,
  .irq        = PIC32MZ_IRQ_T6,
#ifdef CONFIG_PIC32MZ_T6_STOPINIDLE
  .stopinidle = true,
#else
  .stopinidle = false,
#endif
#ifdef CONFIG_PIC32MZ_T6_GATED
  .gated     = true,
  .tckreg    = PIC32MZ_T6CKR,
  .tckpps    = BOARD_T6CK_PPS,
  .tckpin    = GPIO_T6CK,
#else
  .gated     = false,
#endif
  .prescale  = CONFIG_PIC32MZ_T6_PRESCALE,
#ifdef CONFIG_PIC32MZ_T6_MODE32
  .mode32    = true,
#else
  .mode32    = false,
#endif
#ifdef CONFIG_PIC32MZ_T6_EXTERNALCLOCK
  .extclock  = true,
  .tckreg    = PIC32MZ_T6CKR,
  .tckpps    = BOARD_T6CK_PPS,
  .tckpin    = GPIO_T6CK,
#else
  .extclock  = false,
#endif
};

static struct pic32mz_timer_priv_s pic32mz_t6_priv =
{
  .ops        = &pic32mz_timer_ops,
  .config     = &pic32mz_timer_t6_config,
  .inuse      = false,
};
#endif

#ifdef CONFIG_PIC32MZ_T7
static struct pic32mz_timer_config_s pic32mz_timer_t7_config =
{
  .base       = PIC32MZ_TIMER7_K1BASE,
  .irq        = PIC32MZ_IRQ_T7,
#ifdef CONFIG_PIC32MZ_T7_STOPINIDLE
  .stopinidle = true,
#else
  .stopinidle = false,
#endif
#ifdef CONFIG_PIC32MZ_T7_GATED
  .gated     = true,
  .tckreg    = PIC32MZ_T7CKR,
  .tckpps    = BOARD_T7CK_PPS,
  .tckpin    = GPIO_T7CK,
#else
  .gated     = false,
#endif
  .prescale  = CONFIG_PIC32MZ_T7_PRESCALE,
  .mode32    = false,
#ifdef CONFIG_PIC32MZ_T7_EXTERNALCLOCK
  .extclock  = true,
  .tckreg    = PIC32MZ_T7CKR,
  .tckpps    = BOARD_T7CK_PPS,
  .tckpin    = GPIO_T7CK,
#else
  .extclock  = false,
#endif
};

static struct pic32mz_timer_priv_s pic32mz_t7_priv =
{
  .ops        = &pic32mz_timer_ops,
  .config     = &pic32mz_timer_t7_config,
  .inuse      = false,
};
#endif

