apache/nuttx/arch/mips/src/pic32mz/pic32mz-timer.c
#ifdef CONFIG_PIC32MZ_T8
static struct pic32mz_timer_config_s pic32mz_timer_t8_config =
{
  .base       = PIC32MZ_TIMER8_K1BASE,
  .irq        = PIC32MZ_IRQ_T8,
#ifdef CONFIG_PIC32MZ_T8_STOPINIDLE
  .stopinidle = true,
#else
  .stopinidle = false,
#endif
#ifdef CONFIG_PIC32MZ_T8_GATED
  .gated     = true,
  .tckreg    = PIC32MZ_T8CKR,
  .tckpps    = BOARD_T8CK_PPS,
  .tckpin    = GPIO_T8CK,
#else
  .gated     = false,
#endif
  .prescale  = CONFIG_PIC32MZ_T8_PRESCALE,
#ifdef CONFIG_PIC32MZ_T8_MODE32
  .mode32    = true,
#else
  .mode32    = false,
#endif
#ifdef CONFIG_PIC32MZ_T8_EXTERNALCLOCK
  .extclock  = true,
  .tckreg    = PIC32MZ_T8CKR,
  .tckpps    = BOARD_T8CK_PPS,
  .tckpin    = GPIO_T8CK,
#else
  .extclock  = false,
#endif
};

static struct pic32mz_timer_priv_s pic32mz_t8_priv =
{
  .ops        = &pic32mz_timer_ops,
  .config     = &pic32mz_timer_t8_config,
  .inuse      = false,
};
#endif

#ifdef CONFIG_PIC32MZ_T9
static struct pic32mz_timer_config_s pic32mz_timer_t9_config =
{
  .base       = PIC32MZ_TIMER9_K1BASE,
  .irq        = PIC32MZ_IRQ_T9,
#ifdef CONFIG_PIC32MZ_T9_STOPINIDLE
  .stopinidle = true,
#else
  .stopinidle = false,
#endif
#ifdef CONFIG_PIC32MZ_T9_GATED
  .gated     = true,
  .tckreg    = PIC32MZ_T9CKR,
  .tckpps    = BOARD_T9CK_PPS,
  .tckpin    = GPIO_T9CK,
#else
  .gated     = false,
#endif
  .prescale  = CONFIG_PIC32MZ_T9_PRESCALE,
  .mode32    = false,
#ifdef CONFIG_PIC32MZ_T9_EXTERNALCLOCK
  .extclock  = true,
  .tckreg    = PIC32MZ_T9CKR,
  .tckpps    = BOARD_T9CK_PPS,
  .tckpin    = GPIO_T9CK,
#else
  .extclock  = false,
#endif
};

static struct pic32mz_timer_priv_s pic32mz_t9_priv =
{
  .ops        = &pic32mz_timer_ops,
  .config     = &pic32mz_timer_t9_config,
  .inuse      = false,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: pic32mz_getreg
 *
 * Description:
 *   Get a 32-bit register value by offset
 *
 ****************************************************************************/

static inline uint32_t pic32mz_getreg(FAR struct pic32mz_timer_dev_s *dev,
                                      uint16_t offset)
{
  FAR struct pic32mz_timer_priv_s *priv =
    (FAR struct pic32mz_timer_priv_s *)dev;

  return getreg32(priv->config->base + offset);
}

/****************************************************************************
 * Name: pic32mz_putreg
 *
 * Description:
 *  Put a 32-bit register value by offset
 *
 ****************************************************************************/

static inline void pic32mz_putreg(FAR struct pic32mz_timer_dev_s *dev,
                                  uint16_t offset, uint32_t value)
{
  FAR struct pic32mz_timer_priv_s *priv =
    (FAR struct pic32mz_timer_priv_s *)dev;

  putreg32(value, priv->config->base + offset);
}

/****************************************************************************
 * Name: pic32mz_timer_mode32
 *
 * Description:
 *  Returns true if the 32 mode is enabled
 *
 ****************************************************************************/

static inline bool pic32mz_timer_mode32(FAR struct pic32mz_timer_dev_s *dev)
{
  return ((FAR struct pic32mz_timer_priv_s *)dev)->config->mode32;
}

/****************************************************************************
 * Name: pic32mz_timer_oddoffset
 *
 * Description:
 *  Returns the offset of the consecutive odd timer
 *
 ****************************************************************************/

static inline uint32_t pic32mz_timer_oddoffset(uint32_t evenoffset)
{
  /* To access the consecutive odd timer the base needs te be changed.
   * PIC32MZ_TIMERn_OFFSET(1) represents the offset between timers' base.
   * An even timer's base + PIC32MZ_TIMERn_OFFSET(1) gives the base of
   * the next odd timer.
   * This wil allow the access of the odd timer from the dev of its
   * previous even timer.
   */

  return PIC32MZ_TIMERn_OFFSET(1) + evenoffset;
}

/****************************************************************************
 * Name: pic32mz_timer_nextirq
 *
 * Description:
 *  Returns the irq of the consecutive odd numbered timer
 *
 ****************************************************************************/

static inline uint32_t pic32mz_timer_nextirq(FAR struct pic32mz_timer_dev_s *dev)
{
  uint32_t irq;

  irq = ((FAR struct pic32mz_timer_priv_s *)dev)->config->irq;

  /* The irq offsets between odd and even timers
   * are not always the same.
   */

  if (irq == PIC32MZ_IRQ_T2 || irq == PIC32MZ_IRQ_T4)
    {
      return irq + 5;
    }
  else
    {
      return irq + 4;
    }
}

/****************************************************************************
 * Name: pic32mz_timer_start
 *
 * Description:
 *   Start the timer by setting its ON bit
 *
 ****************************************************************************/

static void pic32mz_timer_start(FAR struct pic32mz_timer_dev_s *dev)
{
  pic32mz_putreg(dev, PIC32MZ_TIMER_CONSET_OFFSET, TIMER_CON_ON);
}

/****************************************************************************
 * Name: pic32mz_timer_stop
 *
 * Description:
 *   Stop the timer by clearing the ON bit
 *
 ****************************************************************************/

static void pic32mz_timer_stop(FAR struct pic32mz_timer_dev_s *dev)
{
  pic32mz_putreg(dev, PIC32MZ_TIMER_CONCLR_OFFSET, TIMER_CON_ON);
}

/****************************************************************************
 * Name: pic32mz_timer_stopinidle
 *
 * Description:
 *   Stop the timer in idle mode
 *
 ****************************************************************************/

static void pic32mz_timer_stopinidle(FAR struct pic32mz_timer_dev_s *dev,
                                     bool stop)
{
  if (stop)
    {
      pic32mz_putreg(dev, PIC32MZ_TIMER_CONSET_OFFSET, TIMER_CON_SIDL);
    }
  else
    {
      pic32mz_putreg(dev, PIC32MZ_TIMER_CONCLR_OFFSET, TIMER_CON_SIDL);

      /* In 32bit mode, this bit should be cleared
       * for the odd timer as well.
       */

      if (pic32mz_timer_mode32(dev))
        {
          pic32mz_putreg(dev,
                         pic32mz_timer_oddoffset(PIC32MZ_TIMER_CONCLR_OFFSET),
                         TIMER_CON_SIDL);
        }
    }

  ((FAR struct pic32mz_timer_priv_s *)dev)->config->stopinidle = stop;
}

/****************************************************************************
 * Name: pic32mz_timer_enablegate
 *
 * Description:
 *   Enabled gated time accumulation.
 *   This has no effect when external clock source is enabled
 *
 ****************************************************************************/

static void pic32mz_timer_enablegate(FAR struct pic32mz_timer_dev_s *dev,
                                     bool enable)
{
  FAR struct pic32mz_timer_priv_s *priv =
    (FAR struct pic32mz_timer_priv_s *)dev;

  if (enable)
    {
      pic32mz_putreg(dev, PIC32MZ_TIMER_CONSET_OFFSET, TIMER_CON_TGATE);

      /* Configure the TxCK input pin */

      putreg32(priv->config->tckpps, priv->config->tckreg);
      pic32mz_configgpio(priv->config->tckpin);
    }
  else
    {
      pic32mz_putreg(dev, PIC32MZ_TIMER_CONCLR_OFFSET, TIMER_CON_TGATE);
    }

  priv->config->gated = enable;
}

/****************************************************************************
 * Name: pic32mz_timer_setprescale
 *
 * Description:
 *   Set the timer's prescaler.
 *
 ****************************************************************************/

static void pic32mz_timer_setprescale(FAR struct pic32mz_timer_dev_s *dev,
                                      uint8_t prescale)
{
  pic32mz_putreg(dev, PIC32MZ_TIMER_CONSET_OFFSET,
                 (prescale << TIMER_CON_TCKPS_SHIFT));

  ((FAR struct pic32mz_timer_priv_s *)dev)->config->prescale = prescale;
}

/****************************************************************************
 * Name: pic32mz_timer_setmode32
 *
 * Description:
 *   Set the timer's mode.
 *   Two 16-bit timers can form a 32-bit timer.
 *
 ****************************************************************************/

