apache/nuttx/arch/mips/src/pic32mz/pic32mz-timer.c
static void pic32mz_timer_setmode32(FAR struct pic32mz_timer_dev_s *dev,
                                    bool enable)
{
  /* Only even timers have the TIMER_CON_T32 bit. */

  if (enable)
    {
      pic32mz_putreg(dev, PIC32MZ_TIMER_CONSET_OFFSET, TIMER_CON_T32);
    }
  else
    {
      pic32mz_putreg(dev, PIC32MZ_TIMER_CONCLR_OFFSET, TIMER_CON_T32);
    }

  ((FAR struct pic32mz_timer_priv_s *)dev)->config->mode32 = enable;
}

/****************************************************************************
 * Name: pic32mz_timer_extclocksource
 *
 * Description:
 *   Set the timer's clock source
 *
 ****************************************************************************/

static void pic32mz_timer_extclocksource(FAR struct pic32mz_timer_dev_s *dev,
                                         bool enable)
{
  FAR struct pic32mz_timer_priv_s *priv =
    (FAR truct pic32mz_timer_priv_s *)dev;

  if (enable)
    {
      pic32mz_putreg(dev, PIC32MZ_TIMER_CONSET_OFFSET, TIMER_CON_TCS);

      /* Configure the TxCK input pin */

      putreg32(priv->config->tckpps, priv->config->tckreg);
      pic32mz_configgpio(priv->config->tckpin);
    }
  else
    {
      pic32mz_putreg(dev, PIC32MZ_TIMER_CONCLR_OFFSET, TIMER_CON_TCS);
    }

  priv->config->extclock = enable;
}

/****************************************************************************
 * Name: pic32mz_timer_inithardware
 *
 * Description:
 *   Initializes the timer's hardware
 *   This function is only called when the timer is first initialized.
 *   It uses the provided configuration.
 *
 ****************************************************************************/

static void pic32mz_timer_inithardware(FAR struct pic32mz_timer_dev_s *dev)
{
  FAR struct pic32mz_timer_priv_s *priv =
    (FAR struct pic32mz_timer_priv_s *)dev;

  /* Initialize the hardware using the startup configuration.
   *
   * Set idle mode operations.
   */

  pic32mz_timer_stopinidle(dev, priv->config->stopinidle);

  /* Enable gated time accumulation if chosen.
   * This operation is ignored if an external clock is used.
   */

  pic32mz_timer_enablegate(dev, priv->config->gated);

  /* Set the input clock prescale
   */

  pic32mz_timer_setprescale(dev, priv->config->prescale);

  /* Set the timer's mode (16 or 32bits)
   * This bit only exists for type B even numbered timers (Timer 2, 4, 6, 8)
   */

  pic32mz_timer_setmode32(dev, priv->config->mode32);

  /* Set the clock source.
   * If an external clock source is used, the timer is driven from TxCK pin.
   */

  pic32mz_timer_extclocksource(dev, priv->config->extclock);
}

/****************************************************************************
 * Name: pic32mz_timer_setperiod
 *
 * Description:
 *   Set the PRx register
 *
 ****************************************************************************/

static void pic32mz_timer_setperiod(FAR struct pic32mz_timer_dev_s *dev,
                                    uint32_t period)
{
  /* In 32bit mode:
   *  - even timers represent the least significant half words.
   *  - odd timers represent the most significant half words.
   */

  if (pic32mz_timer_mode32(dev))
    {
      pic32mz_putreg(dev, PIC32MZ_TIMER_PR_OFFSET, period & 0x00000FFFF);

      pic32mz_putreg(dev, pic32mz_timer_oddoffset(PIC32MZ_TIMER_PR_OFFSET),
                     (period >> 16) & 0x00000FFFF);
    }
  else
    {
      pic32mz_putreg(dev, PIC32MZ_TIMER_PR_OFFSET, period);
    }
}

/****************************************************************************
 * Name: pic32mz_timer_getcounter
 *
 * Description:
 *   Return the TMRx register
 *
 ****************************************************************************/

static uint32_t pic32mz_timer_getcounter(FAR struct pic32mz_timer_dev_s *dev)
{
  /* In 32bit mode:
   *  - even timers represent the least significant half words.
   *  - odd timers represent the most significant half words.
   */

  if (pic32mz_timer_mode32(dev))
    {
      uint16_t lsw;
      uint16_t msw;

      lsw = pic32mz_getreg(dev, PIC32MZ_TIMER_CNT_OFFSET);

      msw = pic32mz_getreg(dev,
                           pic32mz_timer_oddoffset(PIC32MZ_TIMER_CNT_OFFSET));

      return lsw | (msw << 16);
    }
  else
    {
      return pic32mz_getreg(dev, PIC32MZ_TIMER_CNT_OFFSET);
    }

}

/****************************************************************************
 * Name: pic32mz_timer_setcounter
 *
 * Description:
 *   Set the TMRx register
 *
 ****************************************************************************/

static void pic32mz_timer_setcounter(FAR struct pic32mz_timer_dev_s *dev,
                                     uint32_t count)
{
  /* In 32bit mode:
   *  - even timers represent the least significant half words.
   *  - odd timers represent the most significant half words.
   */

  if (pic32mz_timer_mode32(dev))
    {

      pic32mz_putreg(dev, PIC32MZ_TIMER_CNT_OFFSET, count & 0x00000FFFF);

      pic32mz_putreg(dev, pic32mz_timer_oddoffset(PIC32MZ_TIMER_CNT_OFFSET),
                     (count >> 16) & 0x00000FFFF);
    }
  else
    {
      pic32mz_putreg(dev, PIC32MZ_TIMER_CNT_OFFSET, count);
    }
}

/****************************************************************************
 * Name: pic32mz_timer_getfreq
 *
 * Description:
 *   Returns the frequency of the timer in Hz
 *
 ****************************************************************************/

static uint32_t pic32mz_timer_getfreq(FAR struct pic32mz_timer_dev_s *dev)
{
  uint8_t prescale;
  uint32_t freq;

  prescale = ((FAR structpic32mz_timer_priv_s *)dev)->config->prescale;

  /* The prescale values are not a continuous power of 2.
   * There is a gap between 64 and 256 (the 128 is skipped).
   */

  if (prescale == PIC32MZ_TIMER_PRESCALE_1_256)
    {
      freq = BOARD_PBCLK3 / (1 << (prescale + 1));
    }
  else
    {
      freq = BOARD_PBCLK3 / (1 << prescale);
    }

  return freq;
}

/****************************************************************************
 * Name: pic32mz_timer_setfreq
 *
 * Description:
 *   Sets the frequency of the timer in Hz
 *
 ****************************************************************************/

