apache/nuttx/arch/mips/src/pic32mz/pic32mz-timer.c
static bool pic32mz_timer_setfreq(FAR struct pic32mz_timer_dev_s *dev,
                                  uint32_t freq)
{
  uint16_t prescale;
  uint32_t tmrfreq;

  DEBUGASSERT(dev != NULL);

  /* Disable Timer? */

  if (freq == 0)
    {
      tmrwarn("Frequency=%luHz not valid", freq);
      pic32mz_timer_stop(dev);

      return 0;
    }

  prescale = BOARD_PBCLK3 / freq;

  tmrinfo("Prescale value calculated %d\n", prescale);

  if (prescale >= 1 && prescale < 2)
    {
      pic32mz_timer_setprescale(dev, PIC32MZ_TIMER_PRESCALE_1_1);
      tmrinfo("Prescale value chosen %d\n",
                (1 << (PIC32MZ_TIMER_PRESCALE_1_1)));
    }
  else if (prescale >= 2 && prescale < 4)
    {
      pic32mz_timer_setprescale(dev, PIC32MZ_TIMER_PRESCALE_1_2);
      tmrinfo("Prescale value chosen %d\n",
                (1 << (PIC32MZ_TIMER_PRESCALE_1_2)));
    }
  else if (prescale >= 4 && prescale < 8)
    {
      pic32mz_timer_setprescale(dev, PIC32MZ_TIMER_PRESCALE_1_4);
      tmrinfo("Prescale value chosen %d\n",
                (1 << (PIC32MZ_TIMER_PRESCALE_1_4)));
    }
  else if (prescale >= 8 && prescale < 16)
    {
      pic32mz_timer_setprescale(dev, PIC32MZ_TIMER_PRESCALE_1_8);
      tmrinfo("Prescale value chosen %d\n",
                (1 << (PIC32MZ_TIMER_PRESCALE_1_8)));
    }
  else if (prescale >= 16 && prescale < 32)
    {
      pic32mz_timer_setprescale(dev, PIC32MZ_TIMER_PRESCALE_1_16);
      tmrinfo("Prescale value chosen %d\n",
                (1 << (PIC32MZ_TIMER_PRESCALE_1_16)));
    }
  else if (prescale >= 32 && prescale < 64)
    {
      pic32mz_timer_setprescale(dev, PIC32MZ_TIMER_PRESCALE_1_32);
      tmrinfo("Prescale value chosen %d\n",
                (1 << (PIC32MZ_TIMER_PRESCALE_1_32)));
    }
  else if (prescale >= 64 && prescale < 256)
    {
      pic32mz_timer_setprescale(dev, PIC32MZ_TIMER_PRESCALE_1_64);
      tmrinfo("Prescale value chosen %d\n",
                (1 << (PIC32MZ_TIMER_PRESCALE_1_64)));
    }
  else if (prescale >= 256)
    {
      pic32mz_timer_setprescale(dev, PIC32MZ_TIMER_PRESCALE_1_256);
      tmrinfo("Prescale value chosen %d\n",
                (1 << (PIC32MZ_TIMER_PRESCALE_1_256 + 1)));
    }
  else
    {
      tmrerr("The frequency of %luHz cannot be set.\n", freq);
      return false;
    }

  tmrfreq = pic32mz_timer_getfreq(dev);

  tmrinfo("Timer's frequency set to %luHz\n", tmrfreq);

  return true;
}

/****************************************************************************
 * Name: pic32mz_timer_getwidth
 *
 * Description:
 *   Returns the timer's width
 *
 ****************************************************************************/

static uint8_t pic32mz_timer_getwidth(FAR struct pic32mz_timer_dev_s *dev)
{
  return pic32mz_timer_mode32(dev) ? 32 : 16;
}

/****************************************************************************
 * Name: pic32mz_timer_setisr
 *
 * Description:
 *   Set the timer's ISR
 *
 ****************************************************************************/

static int  pic32mz_timer_setisr(FAR struct pic32mz_timer_dev_s *dev,
                                 xcpt_t handler, FAR void *arg)
{
  FAR struct pic32mz_timer_priv_s *priv =
    (FAR struct pic32mz_timer_priv_s *)dev;

  /* Disable interrupt when callback is removed */

  if (!handler)
    {
      if (pic32mz_timer_mode32(dev))
        {
          /* In 32bit mode, the consecutive odd timer controls
           * the interrupt.
           */

          up_disable_irq(pic32mz_timer_nextirq(dev));
          irq_detach(pic32mz_timer_nextirq(dev));
        }
      else
        {
          up_disable_irq(priv->config->irq);
          irq_detach(priv->config->irq);
        }
    }

  /* Otherwise set callback and enable interrupt */

  else
    {
      if (pic32mz_timer_mode32(dev))
        {
          /* In 32bit mode, the consecutive odd timer controls
           * the interrupt.
           */

          irq_attach(pic32mz_timer_nextirq(dev), handler, arg);
          up_enable_irq(pic32mz_timer_nextirq(dev));
        }
      else
        {
          irq_attach(priv->config->irq, handler, arg);
          up_enable_irq(priv->config->irq);
        }
    }

  return OK;
}

/****************************************************************************
 * Name: pic32mz_timer_ackint
 *
 * Description:
 *   Acknowledge the timer's interrupt
 *
 ****************************************************************************/

static void pic32mz_timer_ackint(FAR struct pic32mz_timer_dev_s *dev)
{
  up_clrpend_irq(((FAR structpic32mz_timer_priv_s *)dev)->config->irq);

  if (pic32mz_timer_mode32(dev))
    {
      /* In 32bit mode, the consecutive odd timer controls the interrupt. */

      up_clrpend_irq(pic32mz_timer_nextirq(dev));
    }
}

/****************************************************************************
 * Name: pic32mz_timer_checkint
 *
 * Description:
 *   Check if the timer's interrupt is pending
 *
 ****************************************************************************/

static bool  pic32mz_timer_checkint(FAR struct pic32mz_timer_dev_s *dev)
{
  if (pic32mz_timer_mode32(dev))
    {
      /* In 32bit mode, the consecutive odd timer controls the interrupt. */

      return up_pending_irq(pic32mz_timer_nextirq(dev));
    }
  else
    {
      return up_pending_irq(((FAR structpic32mz_timer_priv_s *)dev)->config->irq);
    }
}

/****************************************************************************
 * Pubic Functions
 ****************************************************************************/

/****************************************************************************
 * Name: pic32mz_timer_init
 ****************************************************************************/

FAR struct pic32mz_timer_dev_s *pic32mz_timer_init(int timer)
{
  struct pic32mz_timer_dev_s *dev = NULL;

  switch (timer)
    {
#ifdef CONFIG_PIC32MZ_T2
      case 2:
        dev = (FAR structpic32mz_timer_dev_s *)&pic32mz_t2_priv;
        break;
#endif
#ifdef CONFIG_PIC32MZ_T3
      case 3:
        dev = (FAR structpic32mz_timer_dev_s *)&pic32mz_t3_priv;
        break;
#endif
#ifdef CONFIG_PIC32MZ_T4
      case 4:
        dev = (FAR structpic32mz_timer_dev_s *)&pic32mz_t4_priv;
        break;
#endif
#ifdef CONFIG_PIC32MZ_T5
      case 5:
        dev = (FAR structpic32mz_timer_dev_s *)&pic32mz_t5_priv;
        break;
#endif
#ifdef CONFIG_PIC32MZ_T6
      case 6:
        dev = (FAR structpic32mz_timer_dev_s *)&pic32mz_t6_priv;
        break;
#endif
#ifdef CONFIG_PIC32MZ_T7
      case 7:
        dev = (FAR structpic32mz_timer_dev_s *)&pic32mz_t7_priv;
        break;
#endif
#ifdef CONFIG_PIC32MZ_T8
      case 8:
        dev = (FAR structpic32mz_timer_dev_s *)&pic32mz_t8_priv;
        break;
#endif
#ifdef CONFIG_PIC32MZ_T9
      case 9:
        dev = (FAR structpic32mz_timer_dev_s *)&pic32mz_t9_priv;
        break;
#endif
      default:
        return NULL;
    }

  if (((FAR structpic32mz_timer_priv_s *)dev)->inuse)
    {
      return NULL;
    }
  else
    {
      /* Init the timer's hardware (prescale, clock source, ..) */

      pic32mz_timer_inithardware(dev);

      ((FAR structpic32mz_timer_priv_s *)dev)->inuse = true;

      return dev;
    }
}

int pic32mz_timer_deinit(FAR struct pic32mz_timer_dev_s *dev)
{
  /* Stop the timer in case it was still running
   * and mark it as unused.
   */

  pic32mz_timer_stop(dev);
  ((FAR structpic32mz_timer_priv_s *)dev)->inuse = false;

  return OK;
}

#endif /* defined(CONFIG_PIC32MZ_T2 || ... || T9) */
